Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/after_a_death/funerals.html.txt.tmx
Source language: en
Languages: ga

source: Funeral arrangements are usually made by the immediate family of the deceased
ga: Is gnách go ndéanann neasteaghlach an mhairbh na socruithe le haghaidh sochraide

source: The deceased may have left specific instructions about where to be buried or cremated and what form the funeral service should take
ga: D’fhéadfadh gur fhág an marbh orduithe sonracha faoin áit a bhfuiltear le hé/hí a chur nó a chréamadh agus faoi fhoirm cheart sheirbhís na sochraide

source: Most people respect the deceased’s wishes where possible
ga: Bíonn meas ag an tromlach ar thoil an mhairbh, sa chás gur féidir

source: If there is any dispute about who is entitled to make the arrangements or about the precise arrangements, the personal representatives are entitled to make the decisions
ga: Má thagann aon díospóid aníos faoi cé atá i dteideal socruithe a dhéanamh nó faoi na socruithe féin ar leith, tá na hionadaithe pearsanta i dteideal na cinntí a dhéanamh

source: The personal representatives of the deceased are the executors of the will if there is a will or the people entitled to administer the estate if there is no will
ga: Is iad ionadaithe pearsanta an mhairbh seiceadóirí na huachta más ann d’uacht nó na daoine atá i dteideal an t-eastát a riar murab ann d’uacht

source: The people entitled to administer the estate in the absence of a will are immediate family members
ga: Is iad daoine muinteartha an neasteaghlaigh na daoine atá i dteideal an t-eastát a riar ceal uachta

source: You can engage an undertaker or funeral director to deal with most aspects of the funeral
ga: Féadfaidh tú adhlacóir nó stiúrthóir sochraide a fhostú chun déileáil leis an gcuid is mó de ghnéithe na sochraide

source: The Irish Association of Funeral Directors is the undertaker industry's trade association
ga: Is iad Cumann Stiúrthóirí Sochraide na hÉireann an cumann trádála a bunaíodh do thionscal an adhlacóra

source: Members must follow its Code of Practice, which commits members to:
ga: Ní mór dá bhaill a Chód Cleachtais a chomhlíonadh, a leagan na dualgais a leanas ar a bhaill:

source: • discussing and agreeing funeral director's charges with the next of kin in advance, unless expressly asked not to do this
ga: • táillí an stiúrthóra sochraide a phlé agus a chomhaontú leis an neasghaol roimh ré, mura n-iarrtar go sonrach gan seo a dhéanamh

source: • professionalism and quality of service in arranging and conducting the funeral
ga: • gairmiúlacht agus cáilíocht na seirbhíse maidir leis an tsochraid a eagrú agus tabhairt fúithi

source: • openness about cost and payment
ga: • oscailteacht faoin gcostas agus faoin íocaíocht

source: • accurate advertising of prices and services
ga: • fógraíocht chruinn faoi phraghsanna agus seirbhísí

source: • sensitivity, confidentiality and a commitment to leaving the customer in control of decisions
ga: • íogaireacht, rúndacht agus bheith tiomanta chun gach cinneadh a fhágáil faoin gcustaiméir lena dhéanamh

source: Individual funeral arrangements vary widely and depend on, among other things, where the funeral is taking place, the type of coffin (casket) you get and whether or not you hire funeral cars
ga: Bíonn difríocht fhairsing idir socruithe sochraide faoi leith agus braitheann siad, i measc rudaí eile, ar cá bhfuil an tsochraid ar siúl, cén saghas cónra atá i gceist agus an mbeidh gluaisteáin sochraide ar cíos agat nó nach mbeidh

source: The funeral director's job may include the following:
ga: D’fhéadfaí a áireamh le post an stiúrthóra sochraide an méid a leanas:

source: • Discussing the family's and deceased's wishes and ensuring that all the details are taken care of and that the whole process goes smoothly
ga: • A bhfuil ag teastáil ón teaghlach agus ón marbh agus a chinntiú go dtugtar faoi gach ceann de na sonraí agus go ngabhann an próiseas go léir ar aghaidh mar is ceart

source: • Provision of the coffin, hearse, habit/shroud, limousine/transport of family and embalming
ga: • An cónra, an cóiste, an aibíd/taiséadach, limisín/iompar an teaghlaigh a chur ar fáil agus an corp a bhalsú

source: • Organisation of and payment for the grave purchase, grave opening/cremation charges, church offerings, newspaper announcements, flowers, music at the ceremony and catering
ga: • Socrú agus íocaíocht cheannach na huaighe, oscailt na huaighe/táillí créamtha, ofrálacha eaglaise, fógraí nuachtáin, bláthanna, ceol ag an searmanas agus lónadóireacht a chur ar fáil

source: Embalming is a process involving the replacement of all body fluids with a substance designed to prevent the body from deteriorating
ga: Foladh a stopann an corp ag meath a chur isteach sa chorp in áit na ngnáthsilteacha uilig atá i gceist le corp a bhalsú

source: It is not strictly necessary, especially if the removal and funeral take place relatively quickly after death
ga: Ní gá é a dhéanamh, go háirid má théann an corp chuig an seipéal agus má bhíonn an sochraid ann go luath tar éis báis

source: About half of all bodies are embalmed
ga: Thart ar leath na gcorp ar fad sa tír a bhalsaítear

source: The local authority then usually appoints a registrar or caretaker for each burial ground to manage the sale of plots in that site and to maintain the burial ground in some cases
ga: Tá difríochtaí móra idir praghasanna uaigheanna agus sochraidí, agus mar sin más féidir is fiú praghasanna a fhiosrú in áiteanna eagsúla

source: It is possible to bury a loved one outside an official graveyard, for example, on family land
ga: Is féidir duine a adhlacadh taobh amuigh de reilig oifigiúil, ar thalamh an teaghlaigh mar shampla

source: However, it is very difficult to do so
ga: Ach, tá sé thar a bheith deacair é seo a dhéanamh

source: It is very wise to sort this out well in advance of the death, as it may be impossible to organise legally at short notice
ga: Tá sé an-chríonna é seo ar fad a shocrú i bhfad roimh an mbás, ní gá go mbeidh sé indéanta na socruithe dleathúla a chur i gcrích taobh istigh de achar gairid

source: You will receive a visit from an Environmental Health Inspector from the local authority's health department who will ascertain that the proposed burial site will not pollute any water sources or drainage channels and goes down to a depth of eight feet
ga: Tiocfaidh Cigire Sláinte Timpeallachta ó rannóg sláinte an údaráis áitiúil le cinntiú nach mbeidh an áit adhlacaidh ag cur isteach ar fhoinsí uisce nó bealaí draenála agus go bhfuil doimhneacht de ocht dtroigh ann

source: You should get in touch wtih your local authority (County Council or Corporation) for further details
ga: Ba cheart scríobh chuig an údarás áitiúil cuí (Comhairle Condae nó Bardás) le sonraí a fháil

source: You can have the deceased's body cremated and dispose of the ashes by burying them in a family plot, using facilities provided by the crematorium or disposing of them privately
ga: Is féidir corp an mhairbh a chréamadh agus an luaith a chur in uaigh an teaghlaigh, na háiseanna ag an gcréamatóir a úsáid, nó iad a chur de láimh go príobháideach

source: Funeral costs can vary widely depending on what you opt for and depending on whether it is a city or country funeral (rural funeral costs are generally less expensive)
ga: Bíonn an-difríocht idir costais sochraide ag brath ar céard go díreach a bhíonn ag teastáil uait agus ag brath ar sa chathair nó faoin tuath atá an tsochraid (go ginearálta cosnaíonn sochraid faoin tuath níos lú)

source: If you have difficulty paying for the funeral, your Department of Social Protection's representative at your local health centre (formerly known as the Community Welfare Officer) may be able to help
ga: Má tá deacrachtaí agat le n-íoc as sochraid labhair leis an t-ionadaí Roinne Coimirce Sóisialaí ag d'ionad sláinte áitiúil (a tugadh an tOifigeach Leasa Pobail air roimhe seo) agus d'fhéadfadh sé go mbeadh sé/sí in ann cabhrú leat

source: Information for those recently bereaved
ga: Faisnéis dóibh siúd a bhí thíos le méala le déanaí

source: Bereavement - information for those recently bereaved is a publication from the Citizens Information Board
ga: Foilseachán is ea Méala – faisnéis dóibh siúd a bhí thíos le méala le déanaí ón mBord um Fhaisnéis do Shaoránaigh

source: The Irish Association of Funeral Directors has a Customer Care Charter that includes a complaints procedure
ga: Tá an leabhrán seo dírithe orthu siúd a bhí thíos le méala le déanaí agus soláthraítear ann faisnéis agus comhairle ar cheisteanna praiticiúla agus ábhartha a thagann chun solais i ndiaidh báis

source: The procedure involves investigating complaints, trying to find a resolution and providing a full response in writing within 30 days
ga: Cuimsítear ann faisnéis ar an méid atá le déanamh díreach i ndiaidh báis, teidlíochtaí féideartha leasa shóisialaigh, cáin, saincheisteanna cánach, airgeadais agus dlíthiúla a d’fhéadfadh eascairt agus cá féidir leat dul chun faisnéis agus tacaíocht bhreise a fháil
